In [18]:
# Libraries 
# -----------------------------------------------------------------------
import pandas as pd
import numpy as np


# Configuration
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None)

In [19]:
# Psss! README!
# The purpose of this code is to explore the data from customer_flight_activity.csv and customer_loyalty_history.csv files. 
# Providing information for the user for decision making.
# In adition, it performs the data transformation based on the conclusions from 01_exploration_conclusions.md.
# The final output is a new file customer_data_transformed, where clean and trnasformed data from both csv is united.

In [20]:
# ðŸ“‚ Open data 

df_customer_flights = pd.read_csv("data/customer_flight_activity.csv")
df_customer_loyalty = pd.read_csv("data/customer_loyalty_history.csv")
dataframes_dict = {"df_customer_flightâœˆï¸" : df_customer_flights, "df_customer_loyaltyðŸ’ž" : df_customer_loyalty}

In [21]:
# âœï¸ Exploratory Data Analysis functions definition

def explore_dataframes (df_dict):
    """
    Explores and displays various statistics and details for each DataFrame in the provided dictionary.

    Args:
        df_dict (dict): A dictionary where the keys are DataFrame names (strings) and the values are pandas DataFrames.

    Returns:
        dict: A dictionary with DataFrame names (with "_duplicates" suffix) as keys and DataFrames with duplicate rows as values.

    Example:
        >>> import pandas as pd
        >>> df1 = pd.DataFrame({
        ...     'A': [1, 2, 2, 4],
        ...     'B': ['foo', 'bar', 'foo', 'baz']
        ... })
        >>> df2 = pd.DataFrame({
        ...     'C': [10, 20, 30],
        ...     'D': [1.1, None, 3.3]
        ... })
        >>> df_dict = {'df1': df1, 'df2': df2}
        >>> duplicates = explore_dataframes(df_dict)
        
        Output:
        Dataframe INFO:
        FIRST FIVE (5) ROWS:
        LAST FIVE (5) ROWS:
        SAMPLE (5) ROWS:
        DUPLICATES COUNT:
        DATAFRAME WITH DUPLICATED ROWS (INCLUDING ALL APPEARANCES):
        COUNT OF ROWS WITH ALL NULL VALUES IS:
        COUNT OF COLUMNS WITH ALL NULL VALUES IS:
        STATISTICAL METRICS FOR NUMERICAL COLUMNS:
        STATISTICAL METRICS FOR CATEGORICAL COLUMNS:

    Notes:
        - The function prints information including the shape, first and last five rows, a sample of rows, duplicate counts, counts of rows and columns with all null values, and statistical metrics for numerical and categorical columns.
        - If there are no categorical columns, it will print an error message.
        - It returns a dictionary of DataFrames containing only duplicated rows, with the names of the DataFrames suffixed by "_duplicates".
    """
    duplicate_dataframes_dict = {}
    for name, df in df_dict.items():
        df_name = f"'{name.upper().replace('_',' ')}'"
        print(f" \n\n----------- DATAFRAME NAME: {df_name} -----------")
        print(f"\n{df_name} ---> Dataframe INFO:\n")
        display(df.info())
        print(f"\n{df_name} ---> FIRST FIVE (5) ROWS:")
        display(df.head())
        print(f"\n{df_name} ---> LAST FIVE (5) ROWS:")
        display(df.tail())
        print(f"\n{df_name} ---> SAMPLE (5) ROWS:")
        display(df.sample(5))
        print(f" \n{df_name} ---> DUPLICATES COUNT IS: {df.duplicated().sum()}, {round((df.duplicated().sum()/df.shape[0]*100),2)}% OVER TOTAL ROWS\n")
        if df.duplicated().sum() > 0:
            duplicates_df_name = name + "_duplicates"
            duplicates_df = df[df.duplicated(keep=False)]
            print(f"{df_name} ---> DATAFRAME WITH DUPLICATED ROWS (INCLUDING ALL APPEARANCES):\n")
            display(duplicates_df.head(10))
            duplicate_dataframes_dict[duplicates_df_name] = duplicates_df
        print(f"\n{df_name} --> COUNT OF ROWS WITH ALL NULL VALUES IS: {df.isnull().all(axis=1).sum()}\n")
        print(f"\n{df_name} --> COUNT OF COLUMNS WITH ALL NULL VALUES IS: {df.isnull().all().sum()}\n")
        print(F"\n{df_name} --> STATISTICAL METRICS FOR NUMERICAL COLUMNS:")
        display(df.describe().T)
        try:
            print(F"\n{df_name} --> STATISTICAL METRICS FOR CATEGORICAL COLUMNS:")
            display(df.describe(include="object").T)
        except:
            print("\nUPS... IT SEEMS LIKE THERE ARE NO COLUMNS WITH CATEGORICATL DATA")
    return duplicate_dataframes_dict

def explore_columns (df_dict):
    """
    Explores and displays detailed information about each column in the DataFrames provided in the dictionary.

    Args:
        df_dict (dict): A dictionary where the keys are DataFrame names (strings) and the values are pandas DataFrames.

    Returns:
        None: This function prints detailed column information for each DataFrame but does not return any value.

    Example:
        >>> import pandas as pd
        >>> df1 = pd.DataFrame({
        ...     'Age': [25, 30, 25, 40],
        ...     'Gender': ['F', 'M', 'F', 'M']
        ... })
        >>> df2 = pd.DataFrame({
        ...     'Salary': [50000, 60000, None],
        ...     'Department': ['HR', 'Tech', 'Tech']
        ... })
        >>> explore_dataframe_columns({'df1': df1, 'df2': df2})
        
        Output:
        UNIQUE VALUES:
        VALUES COUNT:
        COUNT OF DUPLICATES IN THE COLUMN:
        COUNT OF NULL VALUES IN THE COLUMN:
        STATISTICAL DESCRIPTION (NUMERIC):
        STATISTICAL DESCRIPTION (CATEGORICAL):

    Notes:
        - The function prints unique values, value counts, counts of duplicates and null values, and statistical descriptions for each column.
        - Numerical columns are described with statistics like mean, standard deviation, min, max, etc.
        - Categorical columns are described with counts, unique values, top frequent values, and their frequencies.
        - The function assumes that columns are either numerical or categorical and will handle each type accordingly.
    """
    for name, df in df_dict.items():
        df_name = f"'{name.upper().replace('_',' ')}'"
        print(f" \n\n----------- DATAFRAME NAME: {df_name} -----------")
        for index, column in enumerate(df.columns):
            print (f"\n{index}) Column {column.upper()} (from {(df_name)} dataframe):")
            print (f"\n>>> UNIQUE VALUES:")
            print (df[column].unique())
            print (f"\n>>> VALUES COUNT:")
            print (df[column].value_counts())
            print (f"\n>>> COUNT OF DUPLICATES IN THE COLUMN:")
            print (df.duplicated(subset=[column]).sum())
            print (f"\n>>> COUNT OF NULL VALUES IN THE COLUMN:")
            print (df[column].isnull().sum())
            if df[column].dtype in ['int64', 'float64']:
                print("\nSTATISTICAL DESCRIPTION (NUMERIC):")
                display(df[column].describe())
            else:
                print("\nSTATISTICAL DESCRIPTION (CATEGORICAL):")
                display(df[column].describe(include='object'))
            print ("--------")

In [22]:
# â–¶ï¸ Exploratory Data Analysis code execution

explore_dataframes(dataframes_dict)

explore_columns(dataframes_dict)

----------- DATAFRAME NAME: 'DF CUSTOMER FLIGHTâœˆï¸' -----------

'DF CUSTOMER FLIGHTâœˆï¸' ---> Dataframe INFO:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 405624 entries, 0 to 405623
Data columns (total 10 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Loyalty Number               405624 non-null  int64
 1   Year                         405624 non-null  int64
 2   Month                        405624 non-null  int64
 3   Flights Booked               405624 non-null  int64
 4   Flights with Companions      405624 non-null  int64
 5   Total Flights                405624 non-null  int64
 6   Distance                     405624 non-null  int64
 7   Points Accumulated           405624 non-null  float64
 8   Points Redeemed              405624 non-null  int64
 9   Dollar Cost Points Redeemed  405624 non-null  int64
dtypes: float64(1), int64(9)
memory usage: 30.9 MB

None

'DF CUSTOMER FLIGHTâœˆï¸' ---> FIRST FIVE (5) ROWS:

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
0,100018,2017,1,3,0,3,1521,152.0,0,0
1,100102,2017,1,10,4,14,2030,203.0,0,0
2,100140,2017,1,6,0,6,1200,120.0,0,0
3,100214,2017,1,0,0,0,0,0.0,0,0
4,100272,2017,1,0,0,0,0,0.0,0,0

'DF CUSTOMER FLIGHTâœˆï¸' ---> LAST FIVE (5) ROWS:

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
405619,999902,2018,12,0,0,0,0,0.0,0,0
405620,999911,2018,12,0,0,0,0,0.0,0,0
405621,999940,2018,12,3,0,3,1233,123.0,0,0
405622,999982,2018,12,0,0,0,0,0.0,0,0
405623,999986,2018,12,0,0,0,0,0.0,0,0

'DF CUSTOMER FLIGHTâœˆï¸' ---> SAMPLE (5) ROWS:

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
162931,676376,2017,10,1,0,1,2829,282.0,0,0
381722,626046,2018,11,0,0,0,0,0.0,0,0
188729,514616,2017,1,0,0,0,0,0.0,0,0
73788,430670,2017,5,0,0,0,0,0.0,0,0
224960,594044,2018,11,0,0,0,0,0.0,0,0

'DF CUSTOMER FLIGHTâœˆï¸' ---> DUPLICATES COUNT IS: 1864, 0.46% OVER TOTAL ROWS

'DF CUSTOMER FLIGHTâœˆï¸' ---> DATAFRAME WITH DUPLICATED ROWS (INCLUDING ALL APPEARANCES):

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
41,101902,2017,1,0,0,0,0,0.0,0,0
42,101902,2017,1,0,0,0,0,0.0,0,0
226,112142,2017,1,0,0,0,0,0.0,0,0
227,112142,2017,1,0,0,0,0,0.0,0,0
477,126100,2017,1,0,0,0,0,0.0,0,0
478,126100,2017,1,0,0,0,0,0.0,0,0
566,130331,2017,1,0,0,0,0,0.0,0,0
567,130331,2017,1,0,0,0,0,0.0,0,0
659,135421,2017,1,0,0,0,0,0.0,0,0
660,135421,2017,1,0,0,0,0,0.0,0,0

'DF CUSTOMER FLIGHTâœˆï¸' --> COUNT OF ROWS WITH ALL NULL VALUES IS: 0


'DF CUSTOMER FLIGHTâœˆï¸' --> COUNT OF COLUMNS WITH ALL NULL VALUES IS: 0


'DF CUSTOMER FLIGHTâœˆï¸' --> STATISTICAL METRICS FOR NUMERICAL COLUMNS:

,count,mean,std,min,25%,50%,75%,max
Loyalty Number,405624.0,550037.873084,258935.286969,100018.0,326961.00,550834.0,772194.00,999986.0
Year,405624.0,2017.500000,0.500001,2017.0,2017.00,2017.5,2018.00,2018.0
Month,405624.0,6.500000,3.452057,1.0,3.75,6.5,9.25,12.0
Flights Booked,405624.0,4.115052,5.225518,0.0,0.00,1.0,8.00,21.0
Flights with Companions,405624.0,1.031805,2.076869,0.0,0.00,0.0,1.00,11.0
Total Flights,405624.0,5.146858,6.521227,0.0,0.00,1.0,10.00,32.0
Distance,405624.0,1208.880059,1433.155320,0.0,0.00,488.0,2336.00,6293.0
Points Accumulated,405624.0,123.692721,146.599831,0.0,0.00,50.0,239.00,676.5
Points Redeemed,405624.0,30.696872,125.486049,0.0,0.00,0.0,0.00,876.0
Dollar Cost Points Redeemed,405624.0,2.484503,10.150038,0.0,0.00,0.0,0.00,71.0

'DF CUSTOMER FLIGHTâœˆï¸' --> STATISTICAL METRICS FOR CATEGORICAL COLUMNS:

UPS... IT SEEMS LIKE THERE ARE NO COLUMNS WITH CATEGORICATL DATA


----------- DATAFRAME NAME: 'DF CUSTOMER LOYALTYðŸ’ž' -----------

'DF CUSTOMER LOYALTYðŸ’ž' ---> Dataframe INFO:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16737 entries, 0 to 16736
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Loyalty Number      16737 non-null  int64
 1   Country             16737 non-null  object
 2   Province            16737 non-null  object
 3   City                16737 non-null  object
 4   Postal Code         16737 non-null  object
 5   Gender              16737 non-null  object
 6   Education           16737 non-null  object
 7   Salary              12499 non-null  float64
 8   Marital Status      16737 non-null  object
 9   Loyalty Card        16737 non-null  object
 10  CLV                 16737 non-null  float64
 11  Enrollment Type     16737 non-null  object
 12  Enrollment Year     16737 non-null  int64
 13  Enrollment Month    16737 non-null  int64
 14  Cancellation Year   2067 non-null   float64
 15  Cancellation Month  2067 non-null   float64
dtypes: float64(4), int64(3), object(9)
memory usage: 2.0+ MB

None

'DF CUSTOMER LOYALTYðŸ’ž' ---> FIRST FIVE (5) ROWS:

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
1,549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
2,429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
3,608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
4,530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN

'DF CUSTOMER LOYALTYðŸ’ž' ---> LAST FIVE (5) ROWS:

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
16732,823768,Canada,British Columbia,Vancouver,V6E 3Z3,Female,College,NaN,Married,Star,61850.19,Standard,2012,12,NaN,NaN
16733,680886,Canada,Saskatchewan,Regina,S1J 3C5,Female,Bachelor,89210.0,Married,Star,67907.27,Standard,2014,9,NaN,NaN
16734,776187,Canada,British Columbia,Vancouver,V5R 1W3,Male,College,NaN,Single,Star,74228.52,Standard,2014,3,NaN,NaN
16735,906428,Canada,Yukon,Whitehorse,Y2K 6R0,Male,Bachelor,-57297.0,Married,Star,10018.66,2018 Promotion,2018,4,NaN,NaN
16736,652627,Canada,Manitoba,Winnipeg,R2C 0M5,Female,Bachelor,75049.0,Married,Star,83325.38,Standard,2015,12,2016.0,8.0

'DF CUSTOMER LOYALTYðŸ’ž' ---> SAMPLE (5) ROWS:

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
9169,377724,Canada,Quebec,Tremblant,H5Y 2S9,Male,College,NaN,Married,Nova,14050.17,Standard,2013,2,NaN,NaN
5859,610573,Canada,British Columbia,Vancouver,V6E 3D9,Male,Bachelor,69159.0,Married,Nova,4465.60,Standard,2013,9,NaN,NaN
14814,361827,Canada,Ontario,Toronto,P2T 6G3,Male,Bachelor,87330.0,Married,Star,7870.36,Standard,2016,5,NaN,NaN
11560,827172,Canada,British Columbia,Vancouver,V5R 1W3,Female,College,NaN,Married,Star,2677.28,Standard,2013,5,NaN,NaN
10328,477157,Canada,Ontario,Ottawa,K1F 2R2,Female,Bachelor,50561.0,Married,Nova,19955.26,2018 Promotion,2018,4,NaN,NaN

'DF CUSTOMER LOYALTYðŸ’ž' ---> DUPLICATES COUNT IS: 0, 0.0% OVER TOTAL ROWS


'DF CUSTOMER LOYALTYðŸ’ž' --> COUNT OF ROWS WITH ALL NULL VALUES IS: 0


'DF CUSTOMER LOYALTYðŸ’ž' --> COUNT OF COLUMNS WITH ALL NULL VALUES IS: 0


'DF CUSTOMER LOYALTYðŸ’ž' --> STATISTICAL METRICS FOR NUMERICAL COLUMNS:

,count,mean,std,min,25%,50%,75%,max
Loyalty Number,16737.0,549735.880445,258912.132453,100018.00,326603.00,550434.00,772019.00,999986.00
Salary,12499.0,79245.609409,35008.297285,-58486.00,59246.50,73455.00,88517.50,407228.00
CLV,16737.0,7988.896536,6860.982280,1898.01,3980.84,5780.18,8940.58,83325.38
Enrollment Year,16737.0,2015.253211,1.979111,2012.00,2014.00,2015.00,2017.00,2018.00
Enrollment Month,16737.0,6.669116,3.398958,1.00,4.00,7.00,10.00,12.00
Cancellation Year,2067.0,2016.503145,1.380743,2013.00,2016.00,2017.00,2018.00,2018.00
Cancellation Month,2067.0,6.962748,3.455297,1.00,4.00,7.00,10.00,12.00

'DF CUSTOMER LOYALTYðŸ’ž' --> STATISTICAL METRICS FOR CATEGORICAL COLUMNS:

                 count unique       top   freq
Country          16737      1    Canada  16737
Province         16737     11   Ontario   5404
City             16737     29   Toronto   3351
Postal Code      16737     55   V6E 3D9    911
Gender           16737      2    Female   8410
Education        16737      5  Bachelor  10475
Marital Status   16737      3   Married   9735
Loyalty Card     16737      3      Star   7637
Enrollment Type  16737      2  Standard  15766

----------- DATAFRAME NAME: 'DF CUSTOMER FLIGHTâœˆï¸' -----------

0) Column LOYALTY NUMBER (from 'DF CUSTOMER FLIGHTâœˆï¸' dataframe):

>>> UNIQUE VALUES:
[100018 100102 100140 ... 999731 999788 999891]

>>> VALUES COUNT:
678205    72
989528    48
373638    48
684889    48
684881    48
          ..
428526    24
428536    24
428565    24
428590    24
999891    24
Name: Loyalty Number, Length: 16737, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
388887

>>> COUNT OF NULL VALUES IN THE COLUMN:
0

STATISTICAL DESCRIPTION (NUMERIC):

count    405624.000000
mean     550037.873084
std      258935.286969
min      100018.000000
25%      326961.000000
50%      550834.000000
75%      772194.000000
max      999986.000000
Name: Loyalty Number, dtype: float64

--------

1) Column YEAR (from 'DF CUSTOMER FLIGHTâœˆï¸' dataframe):

>>> UNIQUE VALUES:
[2017 2018]

>>> VALUES COUNT:
2017    202812
2018    202812
Name: Year, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
405622

>>> COUNT OF NULL VALUES IN THE COLUMN:
0

STATISTICAL DESCRIPTION (NUMERIC):

count    405624.000000
mean       2017.500000
std           0.500001
min        2017.000000
25%        2017.000000
50%        2017.500000
75%        2018.000000
max        2018.000000
Name: Year, dtype: float64

--------

2) Column MONTH (from 'DF CUSTOMER FLIGHTâœˆï¸' dataframe):

>>> UNIQUE VALUES:
[ 1  9  2  3 11  4  5  7  6  8 10 12]

>>> VALUES COUNT:
1     33802
9     33802
2     33802
3     33802
11    33802
4     33802
5     33802
7     33802
6     33802
8     33802
10    33802
12    33802
Name: Month, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
405612

>>> COUNT OF NULL VALUES IN THE COLUMN:
0

STATISTICAL DESCRIPTION (NUMERIC):

count    405624.000000
mean          6.500000
std           3.452057
min           1.000000
25%           3.750000
50%           6.500000
75%           9.250000
max          12.000000
Name: Month, dtype: float64

--------

3) Column FLIGHTS BOOKED (from 'DF CUSTOMER FLIGHTâœˆï¸' dataframe):

>>> UNIQUE VALUES:
[ 3 10  6  0  8 11  9  4  7  5  2  1 12 13 14 16 15 17 18 19 20 21]

>>> VALUES COUNT:
0     197992
3      18228
11     15705
5      15084
7      14561
8      14357
9      14164
6      13847
2      13641
10     13363
4      12821
1      12667
13     10782
12     10382
14      7057
15      6582
16      4354
17      3899
18      2958
19      1496
20      1156
21       528
Name: Flights Booked, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
405602

>>> COUNT OF NULL VALUES IN THE COLUMN:
0

STATISTICAL DESCRIPTION (NUMERIC):

count    405624.000000
mean          4.115052
std           5.225518
min           0.000000
25%           0.000000
50%           1.000000
75%           8.000000
max          21.000000
Name: Flights Booked, dtype: float64

--------

4) Column FLIGHTS WITH COMPANIONS (from 'DF CUSTOMER FLIGHTâœˆï¸' dataframe):

>>> UNIQUE VALUES:
[ 0  4  7  1  6  3  5  2 10  8  9 11]

>>> VALUES COUNT:
0     296887
2      19272
3      19015
1      17905
4      13665
5      13424
6       9911
7       7089
8       3965
9       2944
10      1071
11       476
Name: Flights with Companions, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
405612

>>> COUNT OF NULL VALUES IN THE COLUMN:
0

STATISTICAL DESCRIPTION (NUMERIC):

count    405624.000000
mean          1.031805
std           2.076869
min           0.000000
25%           0.000000
50%           0.000000
75%           1.000000
max          11.000000
Name: Flights with Companions, dtype: float64

--------

5) Column TOTAL FLIGHTS (from 'DF CUSTOMER FLIGHTâœˆï¸' dataframe):

>>> UNIQUE VALUES:
[ 3 14  6  0 15 11 12 10  8  9  7  5 16  2  1 17 13 22  4 19 18 21 26 20
 23 25 27 24 28 30 29 31 32]

>>> VALUES COUNT:
0     197992
6      15273
10     14393
8      14056
4      13656
2      13032
12     12409
11     12300
9      10688
13     10499
14     10310
7       9873
3       9783
5       9309
15      8544
16      7727
17      6198
1       6106
18      5757
19      4002
20      3417
21      2610
22      1981
23      1616
24      1209
25       900
26       722
27       504
28       306
29       214
30       150
31        61
32        27
Name: Total Flights, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
405591

>>> COUNT OF NULL VALUES IN THE COLUMN:
0

STATISTICAL DESCRIPTION (NUMERIC):

count    405624.000000
mean          5.146858
std           6.521227
min           0.000000
25%           0.000000
50%           1.000000
75%          10.000000
max          32.000000
Name: Total Flights, dtype: float64

--------

6) Column DISTANCE (from 'DF CUSTOMER FLIGHTâœˆï¸' dataframe):

>>> UNIQUE VALUES:
[1521 2030 1200 ... 1217  617 4135]

>>> VALUES COUNT:
0       197992
2520       410
2880       401
1680       389
2160       365
         ...
1333         1
3722         1
3985         1
4779         1
4135         1
Name: Distance, Length: 4746, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
400878

>>> COUNT OF NULL VALUES IN THE COLUMN:
0

STATISTICAL DESCRIPTION (NUMERIC):

count    405624.000000
mean       1208.880059
std        1433.155320
min           0.000000
25%           0.000000
50%         488.000000
75%        2336.000000
max        6293.000000
Name: Distance, dtype: float64

--------

7) Column POINTS ACCUMULATED (from 'DF CUSTOMER FLIGHTâœˆï¸' dataframe):

>>> UNIQUE VALUES:
[152.   203.   120.   ...  18.75 601.   626.  ]

>>> VALUES COUNT:
0.00      197992
180.00       763
270.00       734
288.00       717
189.00       709
           ...
658.50         1
556.25         1
10.80          1
565.50         1
626.00         1
Name: Points Accumulated, Length: 1549, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
404075

>>> COUNT OF NULL VALUES IN THE COLUMN:
0

STATISTICAL DESCRIPTION (NUMERIC):

count    405624.000000
mean        123.692721
std         146.599831
min           0.000000
25%           0.000000
50%          50.000000
75%         239.000000
max         676.500000
Name: Points Accumulated, dtype: float64

--------

8) Column POINTS REDEEMED (from 'DF CUSTOMER FLIGHTâœˆï¸' dataframe):

>>> UNIQUE VALUES:
[  0 341 364 310 445 312 343 366 389 292 447 324 456 409 436 327 322 291
 323 300 290 309 325 386 321 363 340 670 443 517 444 328 344 367 313 333
 293 449 297 455 372 356 405 381 466 419 369 352 482 335 329 305 415 396
 317 348 314 334 350 330 318 298 420 336 471 680 441 353 484 301 374 417
 501 299 398 307 368 306 347 439 395 481 337 382 426 373 399 424 326 392
 438 467 480 448 308 400 376 375 460 339 385 611 431 320 362 404 442 410
 361 319 435 414 464 477 315 485 370 421 349 371 416 496 510 667 465 434
 346 487 408 500 360 378 345 358 479 380 411 491 505 446 425 476 393 418
 332 401 454 303 594 506 355 302 403 379 437 561 483 597 391 562 342 407
 490 468 488 457 365 357 463 388 413 351 462 440 493 507 338 377 428 525
 390 473 359 423 519 453 522 429 450 383 469 402 354 422 458 384 656 461
 427 478 523 719 538 515 394 472 433 387 540 530 498 512 452 311 470 541
 331 570 527 658 494 638 486 509 316 492 536 502 551 504 304 296 294 495
 432 526 459 589 529 586 537 503 552 779 516 639 474 547 542 557 406 563
 511 518 532 553 508 560 676 716 593 513 499 566 497 546 451 533 489 708
 531 567 521 412 430 610 528 556 582 720 397 578 772 571 534 539 576 585
 520 601 598 630 524 588 550 514 573 544 669 577 580 591 614 574 579 595
 618 776 548 602 543 581 572 607 603 564 620 615 636 575 584 559 648 590
 545 627 608 568 625 637 632 650 600 613 621 535 587 475 592 624 619 554
 583 628 558 664 789 635 617 699 604 646 659 616 704 569 626 609 751 599
 644 800 677 666 596 612 629 657 675 702 683 633 811 688 565 706 605 549
 662 660 295 673 555 631 715 651 697 792 678 655 707 668 687 622 642 781
 695 711 701 721 623 693 692 640 665 684 745 808 746 749 694 643 725 850
 703 726 691 740 737 689 765 649 690 661 696 682 700 750 771 798 710 736
 757 743 654 758 647 606 718 739 814 761 783 679 766 777 799 723 653 730
 681 760 793 742 685 734 839 782 735 756 795 728 780 802 815 851 820 770
 705 738 645 686 755 754 778 671 634 762 784 717 797 744 672 768 790 741
 824 748 674 825 794 845 827 801 714 731 724 876 747 663 709 823 791 804
 832 698 727 833 810 864 753 840 722 641 822 834 844 865 869 733 828 773
 713 821 849 767 759 729 803 838 775 818 843 830 847 872 809 786 812 785
 841 752 712 816 289 652 787 852 848 769 846 870 871 796 807 774 805 763
 806 836 837 857 813 873 732 826 858 817 829 819 866 842 861 855 831 875
 868 835 764 862 874 860 863 854 788 867 859]

>>> VALUES COUNT:
0      381443
447       103
523       100
443        98
516        97
        ...
834         1
858         1
862         1
869         1
859         1
Name: Points Redeemed, Length: 587, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
405037

>>> COUNT OF NULL VALUES IN THE COLUMN:
0

STATISTICAL DESCRIPTION (NUMERIC):

count    405624.000000
mean         30.696872
std         125.486049
min           0.000000
25%           0.000000
50%           0.000000
75%           0.000000
max         876.000000
Name: Points Redeemed, dtype: float64

--------

9) Column DOLLAR COST POINTS REDEEMED (from 'DF CUSTOMER FLIGHTâœˆï¸' dataframe):

>>> UNIQUE VALUES:
[ 0 28 30 25 36 32 24 26 37 33 35 27 31 54 42 29 38 34 39 55 41 49 40 48
 45 53 58 44 43 46 52 47 63 57 62 51 50 64 56 61 65 60 68 59 66 69 67 71
 70]

>>> VALUES COUNT:
0     381443
36      1037
38      1001
40       993
42       983
39       943
44       923
41       913
37       887
43       877
35       852
34       844
32       817
33       800
45       779
30       772
46       753
31       722
47       675
48       638
28       598
29       596
50       595
49       568
52       482
51       435
27       421
54       402
26       379
53       377
56       365
55       343
57       274
58       265
60       260
59       219
25       209
61       175
63       175
62       155
64       152
24       110
66       106
65        90
68        85
67        68
70        38
69        28
71         2
Name: Dollar Cost Points Redeemed, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
405575

>>> COUNT OF NULL VALUES IN THE COLUMN:
0

STATISTICAL DESCRIPTION (NUMERIC):

count    405624.000000
mean          2.484503
std          10.150038
min           0.000000
25%           0.000000
50%           0.000000
75%           0.000000
max          71.000000
Name: Dollar Cost Points Redeemed, dtype: float64

--------


----------- DATAFRAME NAME: 'DF CUSTOMER LOYALTYðŸ’ž' -----------

0) Column LOYALTY NUMBER (from 'DF CUSTOMER LOYALTYðŸ’ž' dataframe):

>>> UNIQUE VALUES:
[480934 549612 429460 ... 776187 906428 652627]

>>> VALUES COUNT:
480934    1
208485    1
455896    1
469781    1
533488    1
         ..
922188    1
780529    1
721438    1
761015    1
652627    1
Name: Loyalty Number, Length: 16737, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
0

>>> COUNT OF NULL VALUES IN THE COLUMN:
0

STATISTICAL DESCRIPTION (NUMERIC):

count     16737.000000
mean     549735.880445
std      258912.132453
min      100018.000000
25%      326603.000000
50%      550434.000000
75%      772019.000000
max      999986.000000
Name: Loyalty Number, dtype: float64

--------

1) Column COUNTRY (from 'DF CUSTOMER LOYALTYðŸ’ž' dataframe):

>>> UNIQUE VALUES:
['Canada']

>>> VALUES COUNT:
Canada    16737
Name: Country, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
16736

>>> COUNT OF NULL VALUES IN THE COLUMN:
0

STATISTICAL DESCRIPTION (CATEGORICAL):

count      16737
unique         1
top       Canada
freq       16737
Name: Country, dtype: object

--------

2) Column PROVINCE (from 'DF CUSTOMER LOYALTYðŸ’ž' dataframe):

>>> UNIQUE VALUES:
['Ontario' 'Alberta' 'British Columbia' 'Quebec' 'Yukon' 'New Brunswick'
 'Manitoba' 'Nova Scotia' 'Saskatchewan' 'Newfoundland'
 'Prince Edward Island']

>>> VALUES COUNT:
Ontario                 5404
British Columbia        4409
Quebec                  3300
Alberta                  969
Manitoba                 658
New Brunswick            636
Nova Scotia              518
Saskatchewan             409
Newfoundland             258
Yukon                    110
Prince Edward Island      66
Name: Province, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
16726

>>> COUNT OF NULL VALUES IN THE COLUMN:
0

STATISTICAL DESCRIPTION (CATEGORICAL):

count       16737
unique         11
top       Ontario
freq         5404
Name: Province, dtype: object

--------

3) Column CITY (from 'DF CUSTOMER LOYALTYðŸ’ž' dataframe):

>>> UNIQUE VALUES:
['Toronto' 'Edmonton' 'Vancouver' 'Hull' 'Whitehorse' 'Trenton' 'Montreal'
 'Dawson Creek' 'Quebec City' 'Fredericton' 'Ottawa' 'Tremblant' 'Calgary'
 'Thunder Bay' 'Whistler' 'Peace River' 'Winnipeg' 'Sudbury'
 'West Vancouver' 'Halifax' 'London' 'Regina' 'Kelowna' "St. John's"
 'Victoria' 'Kingston' 'Banff' 'Moncton' 'Charlottetown']

>>> VALUES COUNT:
Toronto           3351
Vancouver         2582
Montreal          2059
Winnipeg           658
Whistler           582
Halifax            518
Ottawa             509
Trenton            486
Edmonton           486
Quebec City        485
Dawson Creek       444
Fredericton        425
Regina             409
Kingston           401
Tremblant          398
Victoria           389
Hull               358
West Vancouver     324
St. John's         258
Thunder Bay        256
Sudbury            227
Moncton            211
Calgary            191
Banff              179
London             174
Peace River        113
Whitehorse         110
Kelowna             88
Charlottetown       66
Name: City, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
16708

>>> COUNT OF NULL VALUES IN THE COLUMN:
0

STATISTICAL DESCRIPTION (CATEGORICAL):

count       16737
unique         29
top       Toronto
freq         3351
Name: City, dtype: object

--------

4) Column POSTAL CODE (from 'DF CUSTOMER LOYALTYðŸ’ž' dataframe):

>>> UNIQUE VALUES:
['M2Z 4K1' 'T3G 6Y6' 'V6E 3D9' 'P1W 1K4' 'J8Y 3Z5' 'Y2K 6R0' 'P5S 6R4'
 'K8V 4B2' 'H2Y 2W2' 'M8Y 4K8' 'U5I 4F1' 'G1B 3L5' 'H4G 3T4' 'M2M 7K8'
 'M2M 6J7' 'E3B 2H2' 'M1R 4K3' 'T9G 1W3' 'H2Y 4R4' 'V5R 1W3' 'P1L 8X8'
 'K1F 2R2' 'H5Y 2S9' 'V1E 4R6' 'H2T 2J6' 'T3E 2V9' 'H2T 9K8' 'K8T 5M5'
 'V6T 1Y8' 'P2T 6G3' 'T9O 2W2' 'V6E 3Z3' 'R6Y 4T5' 'M5V 1G5' 'V6V 8Z3'
 'B3J 9S2' 'M5B 3E4' 'R2C 0M5' 'S6J 3G0' 'M2P 4F6' 'P1J 8T7' 'V09 2E9'
 'A1C 6H9' 'V10 6T5' 'B3C 2M8' 'M9K 2P4' 'T4V 1D4' 'R3R 3T4' 'S1J 3C5'
 'E1A 2A7' 'K1G 4Z0' 'H3T 8L4' 'C1A 6E8' 'H3J 5I6' 'M3R 4K8']

>>> VALUES COUNT:
V6E 3D9    911
V5R 1W3    684
V6T 1Y8    582
V6E 3Z3    544
M2M 7K8    534
P1J 8T7    500
H2T 9K8    499
K8V 4B2    486
G1B 3L5    485
H2T 2J6    446
U5I 4F1    444
V1E 4R6    443
E3B 2H2    425
R2C 0M5    415
M9K 2P4    401
H5Y 2S9    398
V10 6T5    389
K1F 2R2    389
H2Y 2W2    365
J8Y 3Z5    358
M8Y 4K8    340
H4G 3T4    338
B3J 9S2    329
V6V 8Z3    324
P2T 6G3    322
H2Y 4R4    315
M1R 4K3    313
P1L 8X8    282
P1W 1K4    275
T9G 1W3    266
A1C 6H9    258
M2Z 4K1    257
K8T 5M5    256
P5S 6R4    246
M5V 1G5    227
S6J 3G0    226
T3G 6Y6    220
E1A 2A7    211
T3E 2V9    191
B3C 2M8    189
S1J 3C5    183
T4V 1D4    179
M5B 3E4    174
M2M 6J7    153
R6Y 4T5    143
M2P 4F6    126
K1G 4Z0    120
T9O 2W2    113
Y2K 6R0    110
R3R 3T4    100
H3T 8L4     89
V09 2E9     88
C1A 6E8     66
H3J 5I6      7
M3R 4K8      3
Name: Postal Code, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
16682

>>> COUNT OF NULL VALUES IN THE COLUMN:
0

STATISTICAL DESCRIPTION (CATEGORICAL):

count       16737
unique         55
top       V6E 3D9
freq          911
Name: Postal Code, dtype: object

--------

5) Column GENDER (from 'DF CUSTOMER LOYALTYðŸ’ž' dataframe):

>>> UNIQUE VALUES:
['Female' 'Male']

>>> VALUES COUNT:
Female    8410
Male      8327
Name: Gender, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
16735

>>> COUNT OF NULL VALUES IN THE COLUMN:
0

STATISTICAL DESCRIPTION (CATEGORICAL):

count      16737
unique         2
top       Female
freq        8410
Name: Gender, dtype: object

--------

6) Column EDUCATION (from 'DF CUSTOMER LOYALTYðŸ’ž' dataframe):

>>> UNIQUE VALUES:
['Bachelor' 'College' 'Master' 'High School or Below' 'Doctor']

>>> VALUES COUNT:
Bachelor                10475
College                  4238
High School or Below      782
Doctor                    734
Master                    508
Name: Education, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
16732

>>> COUNT OF NULL VALUES IN THE COLUMN:
0

STATISTICAL DESCRIPTION (CATEGORICAL):

count        16737
unique           5
top       Bachelor
freq         10475
Name: Education, dtype: object

--------

7) Column SALARY (from 'DF CUSTOMER LOYALTYðŸ’ž' dataframe):

>>> UNIQUE VALUES:
[ 83236.     nan 103495. ...  76178.  91970. -57297.]

>>> VALUES COUNT:
 101933.0    23
 62283.0     14
 61809.0     14
 51573.0     14
 64001.0     13
             ..
 95907.0      1
 72440.0      1
 88633.0      1
 100572.0     1
-57297.0      1
Name: Salary, Length: 5890, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
10846

>>> COUNT OF NULL VALUES IN THE COLUMN:
4238

STATISTICAL DESCRIPTION (NUMERIC):

count     12499.000000
mean      79245.609409
std       35008.297285
min      -58486.000000
25%       59246.500000
50%       73455.000000
75%       88517.500000
max      407228.000000
Name: Salary, dtype: float64

--------

8) Column MARITAL STATUS (from 'DF CUSTOMER LOYALTYðŸ’ž' dataframe):

>>> UNIQUE VALUES:
['Married' 'Divorced' 'Single']

>>> VALUES COUNT:
Married     9735
Single      4484
Divorced    2518
Name: Marital Status, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
16734

>>> COUNT OF NULL VALUES IN THE COLUMN:
0

STATISTICAL DESCRIPTION (CATEGORICAL):

count       16737
unique          3
top       Married
freq         9735
Name: Marital Status, dtype: object

--------

9) Column LOYALTY CARD (from 'DF CUSTOMER LOYALTYðŸ’ž' dataframe):

>>> UNIQUE VALUES:
['Star' 'Aurora' 'Nova']

>>> VALUES COUNT:
Star      7637
Nova      5671
Aurora    3429
Name: Loyalty Card, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
16734

>>> COUNT OF NULL VALUES IN THE COLUMN:
0

STATISTICAL DESCRIPTION (CATEGORICAL):

count     16737
unique        3
top        Star
freq       7637
Name: Loyalty Card, dtype: object

--------

10) Column CLV (from 'DF CUSTOMER LOYALTYðŸ’ž' dataframe):

>>> UNIQUE VALUES:
[ 3839.14  3839.61  3839.75 ... 44771.3  50568.26 61134.68]

>>> VALUES COUNT:
8564.77     13
13024.13    12
3808.12     12
2359.42     12
3731.50     12
            ..
16152.90     1
5204.65      1
5620.59      1
5205.02      1
61134.68     1
Name: CLV, Length: 7984, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
8753

>>> COUNT OF NULL VALUES IN THE COLUMN:
0

STATISTICAL DESCRIPTION (NUMERIC):

count    16737.000000
mean      7988.896536
std       6860.982280
min       1898.010000
25%       3980.840000
50%       5780.180000
75%       8940.580000
max      83325.380000
Name: CLV, dtype: float64

--------

11) Column ENROLLMENT TYPE (from 'DF CUSTOMER LOYALTYðŸ’ž' dataframe):

>>> UNIQUE VALUES:
['Standard' '2018 Promotion']

>>> VALUES COUNT:
Standard          15766
2018 Promotion      971
Name: Enrollment Type, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
16735

>>> COUNT OF NULL VALUES IN THE COLUMN:
0

STATISTICAL DESCRIPTION (CATEGORICAL):

count        16737
unique           2
top       Standard
freq         15766
Name: Enrollment Type, dtype: object

--------

12) Column ENROLLMENT YEAR (from 'DF CUSTOMER LOYALTYðŸ’ž' dataframe):

>>> UNIQUE VALUES:
[2016 2014 2013 2012 2015 2018 2017]

>>> VALUES COUNT:
2018    3010
2017    2487
2016    2456
2013    2397
2014    2370
2015    2331
2012    1686
Name: Enrollment Year, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
16730

>>> COUNT OF NULL VALUES IN THE COLUMN:
0

STATISTICAL DESCRIPTION (NUMERIC):

count    16737.000000
mean      2015.253211
std          1.979111
min       2012.000000
25%       2014.000000
50%       2015.000000
75%       2017.000000
max       2018.000000
Name: Enrollment Year, dtype: float64

--------

13) Column ENROLLMENT MONTH (from 'DF CUSTOMER LOYALTYðŸ’ž' dataframe):

>>> UNIQUE VALUES:
[ 2  3  7 10  5  6 12  1 11  8  4  9]

>>> VALUES COUNT:
5     1503
12    1480
7     1473
11    1446
10    1444
8     1430
6     1412
9     1391
4     1388
3     1358
2     1220
1     1192
Name: Enrollment Month, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
16725

>>> COUNT OF NULL VALUES IN THE COLUMN:
0

STATISTICAL DESCRIPTION (NUMERIC):

count    16737.000000
mean         6.669116
std          3.398958
min          1.000000
25%          4.000000
50%          7.000000
75%         10.000000
max         12.000000
Name: Enrollment Month, dtype: float64

--------

14) Column CANCELLATION YEAR (from 'DF CUSTOMER LOYALTYðŸ’ž' dataframe):

>>> UNIQUE VALUES:
[  nan 2018. 2015. 2017. 2014. 2016. 2013.]

>>> VALUES COUNT:
2018.0    645
2017.0    506
2016.0    427
2015.0    265
2014.0    181
2013.0     43
Name: Cancellation Year, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
16730

>>> COUNT OF NULL VALUES IN THE COLUMN:
14670

STATISTICAL DESCRIPTION (NUMERIC):

count    2067.000000
mean     2016.503145
std         1.380743
min      2013.000000
25%      2016.000000
50%      2017.000000
75%      2018.000000
max      2018.000000
Name: Cancellation Year, dtype: float64

--------

15) Column CANCELLATION MONTH (from 'DF CUSTOMER LOYALTYðŸ’ž' dataframe):

>>> UNIQUE VALUES:
[nan  1. 12.  4.  2.  7. 11.  5.  6. 10.  8.  9.  3.]

>>> VALUES COUNT:
12.0    213
11.0    212
8.0     208
7.0     186
10.0    180
9.0     176
6.0     165
1.0     155
3.0     149
5.0     148
2.0     139
4.0     136
Name: Cancellation Month, dtype: int64

>>> COUNT OF DUPLICATES IN THE COLUMN:
16724

>>> COUNT OF NULL VALUES IN THE COLUMN:
14670

STATISTICAL DESCRIPTION (NUMERIC):

count    2067.000000
mean        6.962748
std         3.455297
min         1.000000
25%         4.000000
50%         7.000000
75%        10.000000
max        12.000000
Name: Cancellation Month, dtype: float64

--------

In [23]:
# âœï¸ Data transformation (cleaning and union) functions definition

def columns_to_snake_case (df_dict):
    """
    Converts the column names of each DataFrame in a dictionary to snake_case format and prints the updated column names.

    Args:
        df_dict (dict): A dictionary where the keys are DataFrame names (strings) and the values are pandas DataFrames.

    Returns:
        None: This function modifies the DataFrames in place and prints the updated column names.

    Example:
        >>> import pandas as pd
        >>> df1 = pd.DataFrame(columns=['First Name', 'Last Name'])
        >>> df2 = pd.DataFrame(columns=['Date Of Birth', 'Email Address'])
        >>> df_dict = {'df1': df1, 'df2': df2}
        >>> columns_to_snake_case(df_dict)
        
        Output:
        'DF1' ---> Dataframe COLUMNS:
        Index(['first_name', 'last_name'], dtype='object')

        'DF2' ---> Dataframe COLUMNS:
        Index(['date_of_birth', 'email_address'], dtype='object')

    Notes:
        - The function assumes that the input dictionary contains pandas DataFrames.
        - It will replace spaces with underscores and convert all characters to lowercase.
        - The printed DataFrame names are uppercase with underscores replaced by spaces for readability.
    """
    for name, df in df_dict.items():
        df_name = f"'{name.upper().replace('_',' ')}'"
        df.columns = df.columns.str.lower().str.replace(' ', '_')
        print(f"\n{df_name} ---> Dataframe COLUMNS:\n")
        print(df.columns)

def impute_nulls_as_special_category(df, column_list, category_name):
    """
    Replaces null values in specified columns of a DataFrame with a given category name.

    Args:
        df (pandas.DataFrame): The DataFrame in which null values need to be imputed.
        column_list (list of str): A list of column names where null values should be replaced.
        category_name (str): The category name used to replace null values.

    Returns:
        None: This function modifies the DataFrame in place and prints the status of the operation.

    Example:
        >>> import pandas as pd
        >>> df = pd.DataFrame({
        ...     'Name': ['Alice', None, 'Charlie'],
        ...     'Age': [25, None, 30]
        ... })
        >>> impute_nulls_as_special_category(df, ['Name', 'Age'], 'Unknown')
        
        Output:
        Null values imputed âœ… in column Name.
        UNIQUE VALUES:
        ['Alice' 'Unknown' 'Charlie']
        
        Null values imputed âœ… in column Age.
        UNIQUE VALUES:
        [25.  'Unknown' 30.]

    Notes:
        - The function will only replace null values in columns that exist in the DataFrame.
        - If a column specified in `column_list` does not exist in the DataFrame, a warning message will be printed.
    """
    # Iterate through the list of columns to replace nulls with "category_name"
    for column in column_list:
        if column in df.columns:
            # Replace nulls with the value "category_name" for each column in the list
            df[column] = df[column].fillna(category_name)
            print (f"\nNull values imputed âœ… in column {column}.")
            print (f"UNIQUE VALUES:")
            print (df[column].unique())
        else:
            print(f"âŒ The column '{column}' does not exist in the DataFrame.")

def transform_negative_values(df,column_list):
    """
    Transforms negative values to positive values in specified columns of a DataFrame.

    Args:
        df (pandas.DataFrame): The DataFrame in which negative values need to be converted.
        column_list (list of str): A list of column names where negative values should be transformed.

    Returns:
        None: This function modifies the DataFrame in place and prints the status of the operation.

    Example:
        >>> import pandas as pd
        >>> df = pd.DataFrame({
        ...     'Revenue': [-100, 200, -300],
        ...     'Profit': [50, -75, -20]
        ... })
        >>> transform_negatives_to_positives(df, ['Revenue', 'Profit'])
        
        Output:
        Negative values transformed âœ… in column Revenue.
        UNIQUE VALUES:
        [100 200 300]
        
        Negative values transformed âœ… in column Profit.
        UNIQUE VALUES:
        [ 50  75  20]

    Notes:
        - The function uses the absolute value function (`abs()`) to convert negative values to positive.
        - If a column specified in `column_list` does not exist in the DataFrame, a warning message will be printed.
    """
    for column in column_list:
        if column in df.columns:
            df[column] = df[column].abs()
            print (f"\nNegative values transformed âœ… in column {column}.")
            print (f"UNIQUE VALUES:")
            print (df[column].unique())
        else:
            print(f"âŒ The column '{column}' does not exist in the DataFrame.")

def impute_nulls_as_median(df, column_list):
    """
    Replaces null values in specified columns of a DataFrame with the median value of each column.

    Args:
        df (pandas.DataFrame): The DataFrame in which null values need to be imputed.
        column_list (list of str): A list of column names where null values should be replaced with the median.

    Returns:
        None: This function modifies the DataFrame in place and prints the status of the operation.

    Example:
        >>> import pandas as pd
        >>> df = pd.DataFrame({
        ...     'Age': [25, None, 30],
        ...     'Salary': [50000, 60000, None]
        ... })
        >>> impute_nulls_as_median(df, ['Age', 'Salary'])
        
        Output:
        Null values imputed âœ… in column Age.
        UNIQUE VALUES:
        [25.  27.5 30.]
        
        Null values imputed âœ… in column Salary.
        UNIQUE VALUES:
        [50000. 60000. 55000.]

    Notes:
        - The function computes the median of each column and uses it to replace null values.
        - If a column specified in `column_list` does not exist in the DataFrame, a warning message will be printed.
        - The median calculation ignores null values, so it's only based on the existing non-null values in the column.
    """
    # Iterate through the list of columns to replace nulls with median
    for column in column_list:
        if column in df.columns:
            median= df[column].median()
            # Replace nulls with the median for each column in the list
            df[column] = df[column].fillna(median)
            print (f"\nNull values imputed âœ… in column {column}.")
            print (f"UNIQUE VALUES:")
            print (df[column].unique())
        else:
            print(f"âŒ The column '{column}' does not exist in the DataFrame.")

def dfs_left_union (df_left, df_right):
    """
    Performs a left join (union) between two DataFrames on a specified key and returns the resulting DataFrame.

    Args:
        df_left (pandas.DataFrame): The left DataFrame to be joined.
        df_right (pandas.DataFrame): The right DataFrame to be joined.

    Returns:
        pandas.DataFrame: The resulting DataFrame after performing a left join on the key 'loyalty_number'.

    Example:
        >>> import pandas as pd
        >>> df_customer_flights = pd.DataFrame({
        ...     'loyalty_number': [1, 2, 3],
        ...     'flight_number': ['AA123', 'BB456', 'CC789']
        ... })
        >>> df_customer_loyalty = pd.DataFrame({
        ...     'loyalty_number': [1, 2],
        ...     'customer_name': ['Alice', 'Bob']
        ... })
        >>> df_final = dfs_left_union(df_customer_flights, df_customer_loyalty)
        
        Output:
        Dataframe on the left's SHAPE:(3, 2)
        Dataframe on the right's SHAPE:(2, 2)
        Dataframe were joined successfully âœ…
        Dataframe Final's SHAPE:(3, 3)
        Dataframe Final's COLUMNS are:Index(['loyalty_number', 'flight_number', 'customer_name'], dtype='object')

    Notes:
        - The function performs a left join on the 'loyalty_number' column.
        - If the 'loyalty_number' column is not present in both DataFrames, it will result in an error.
        - Ensure that the column name 'loyalty_number' exists in both DataFrames before calling this function.
    """
    print (f"\nDataframe on the left's SHAPE:{df_left.shape}")
    print (f"\nDataframe on the right's SHAPE:{df_right.shape}")
    df_final = df_customer_flights.merge(df_customer_loyalty, how='left', on='loyalty_number')
    print("\nDataframe were joined succesfully âœ…")
    print (f"\nDataframe Final's SHAPE:{df_final.shape}")
    print (f"\nDataframe Final's COLUMNS are:{df_final.columns}")
    return df_final

In [24]:
# â–¶ï¸ Data Transformation code execution

# Rename columns to snake case format
columns_to_snake_case(dataframes_dict)

# Delete records from df customer_flights that are duplicated in all columns, keeping only the first appearance
df_customer_flights.drop_duplicates(inplace=True)

print(f"DUPLICATES COUNT IS: {df_customer_flights.duplicated().sum()}")

# In columns "cancellation_year" and "cancelation_month" replace NaN with "Not Cancelled"
columns = ["cancellation_year","cancellation_month"]
category_name = "Not Cancelled"
impute_nulls_as_special_category(df_customer_loyalty,columns,category_name)

# In salary column transform negative value into positive and impute nulls assigning the median value
columns = ["salary"]
transform_negative_values(df_customer_loyalty,columns)
impute_nulls_as_median(df_customer_loyalty, columns)

# Join dataframes 
df_final = dfs_left_union(df_customer_flights,df_customer_loyalty)

# Save data into a csv
df_final.to_csv('data/customer_data_transformed.csv')

'DF CUSTOMER FLIGHTâœˆï¸' ---> Dataframe COLUMNS:

Index(['loyalty_number', 'year', 'month', 'flights_booked',
       'flights_with_companions', 'total_flights', 'distance',
       'points_accumulated', 'points_redeemed', 'dollar_cost_points_redeemed'],
      dtype='object')

'DF CUSTOMER LOYALTYðŸ’ž' ---> Dataframe COLUMNS:

Index(['loyalty_number', 'country', 'province', 'city', 'postal_code',
       'gender', 'education', 'salary', 'marital_status', 'loyalty_card',
       'clv', 'enrollment_type', 'enrollment_year', 'enrollment_month',
       'cancellation_year', 'cancellation_month'],
      dtype='object')
DUPLICATES COUNT IS: 0

Null values imputed âœ… in column cancellation_year.
UNIQUE VALUES:
['Not Cancelled' 2018.0 2015.0 2017.0 2014.0 2016.0 2013.0]

Null values imputed âœ… in column cancellation_month.
UNIQUE VALUES:
['Not Cancelled' 1.0 12.0 4.0 2.0 7.0 11.0 5.0 6.0 10.0 8.0 9.0 3.0]

Negative values transformed âœ… in column salary.
UNIQUE VALUES:
[ 83236.     nan 103495. ...  76178.  91970.  57297.]

Null values imputed âœ… in column salary.
UNIQUE VALUES:
[ 83236.  73455. 103495. ...  76178.  91970.  57297.]

Dataframe on the left's SHAPE:(403760, 10)

Dataframe on the right's SHAPE:(16737, 16)

Dataframe were joined succesfully âœ…

Dataframe Final's SHAPE:(403760, 25)

Dataframe Final's COLUMNS are:Index(['loyalty_number', 'year', 'month', 'flights_booked',
       'flights_with_companions', 'total_flights', 'distance',
       'points_accumulated', 'points_redeemed', 'dollar_cost_points_redeemed',
       'country', 'province', 'city', 'postal_code', 'gender', 'education',
       'salary', 'marital_status', 'loyalty_card', 'clv', 'enrollment_type',
       'enrollment_year', 'enrollment_month', 'cancellation_year',
       'cancellation_month'],
      dtype='object')

### Loyalty number column analysis (unfinished)

In [25]:
# check the number of duplicates in loyalty_number column
duplicates = df_customer_flights.duplicated(subset=['loyalty_number']).sum()
print(f"There are {duplicates} duplicates in the column 'loyalty_number', which represent {round((duplicates/df_customer_flights.shape[0]*100),2)}% over the total")

There are 387023 duplicates in the column 'loyalty_number', which represent 95.85% over the total

In [26]:
df_loyalty_number_duplicates = df_customer_flights[df_customer_flights.duplicated(subset=['loyalty_number'])]
print (f"\n>>>DATAFRAME WITH DUPLICATED VALUES IN loyalty_number:")
display(df_loyalty_number_duplicates)

>>>DATAFRAME WITH DUPLICATED VALUES IN loyalty_number:

,loyalty_number,year,month,flights_booked,flights_with_companions,total_flights,distance,points_accumulated,points_redeemed,dollar_cost_points_redeemed
37,100504,2017,2,0,0,0,0,0.0,0,0
39,100504,2017,3,0,0,0,0,0.0,0,0
88,100504,2017,4,0,0,0,0,0.0,0,0
101,100504,2017,5,0,0,0,0,0.0,0,0
115,106001,2017,1,5,0,5,910,91.0,0,0
...,...,...,...,...,...,...,...,...,...,...
405619,999902,2018,12,0,0,0,0,0.0,0,0
405620,999911,2018,12,0,0,0,0,0.0,0,0
405621,999940,2018,12,3,0,3,1233,123.0,0,0
405622,999982,2018,12,0,0,0,0,0.0,0,0
405623,999986,2018,12,0,0,0,0,0.0,0,0

In [27]:
# The information in the dataframe is organized in a way that there is one row per each year and each month within a year. 
# Since there is info from 2 years it is expected to have 24 rows per loyalty_number (or less). So, I will only focus the analysis in those that appear more than 24 times
# Calculate the times of appearance for each loyalty_number
loyalty_number_value_counts = df_customer_flights['loyalty_number'].value_counts()
print (f"\n>>> VALUES COUNT:")
print(loyalty_number_value_counts)
# filter the Series to keep only the values that appear more than 24 times
values_to_keep = loyalty_number_value_counts[loyalty_number_value_counts > 24].index
print (f"\n>>> VALUES WITH MORE THAN 24 ROWS:")
print(values_to_keep)

>>> VALUES COUNT:
974875    48
736504    48
890702    48
617489    48
200519    47
          ..
428402    24
428452    24
428520    24
428523    24
999891    24
Name: loyalty_number, Length: 16737, dtype: int64

>>> VALUES WITH MORE THAN 24 ROWS:
Int64Index([974875, 736504, 890702, 617489, 200519, 528447, 114414, 713132,
            965605, 499874,
            ...
            950304, 750578, 208241, 411030, 106509, 536021, 308480, 831341,
            841296, 746226],
           dtype='int64', length=135)

In [28]:
filtered_df = df_customer_flights[df_customer_flights['loyalty_number'].isin(values_to_keep)].sort_values(by=['loyalty_number','year', 'month','total_flights'])
filtered_df.head(20)

,loyalty_number,year,month,flights_booked,flights_with_companions,total_flights,distance,points_accumulated,points_redeemed,dollar_cost_points_redeemed
41,101902,2017,1,0,0,0,0,0.0,0,0
16942,101902,2017,2,0,0,0,0,0.0,0,0
33843,101902,2017,3,0,0,0,0,0.0,0,0
50744,101902,2017,4,4,0,4,1460,146.0,0,0
185796,101902,2017,4,4,4,8,2384,238.0,488,40
67646,101902,2017,5,7,0,7,3318,331.0,0,0
67645,101902,2017,5,9,3,12,2748,274.0,0,0
84547,101902,2017,6,9,0,9,1521,152.0,0,0
84546,101902,2017,6,10,5,15,3015,301.0,0,0
101447,101902,2017,7,0,0,0,0,0.0,0,0
118349,101902,2017,8,13,0,13,1586,158.0,0,0
118348,101902,2017,8,17,0,17,3893,389.0,0,0
135250,101902,2017,9,3,3,6,2316,231.0,0,0
135249,101902,2017,9,7,0,7,2569,256.0,0,0
152150,101902,2017,10,7,0,7,2191,219.0,0,0
152151,101902,2017,10,5,2,7,2975,297.0,0,0
169052,101902,2017,11,2,0,2,1968,196.0,0,0
169051,101902,2017,11,8,0,8,1824,182.0,0,0
185952,101902,2017,12,0,0,0,0,0.0,0,0
202854,101902,2018,1,0,0,0,0,0.0,0,0

In [30]:
df_customer_loyalty[df_customer_loyalty['loyalty_number'].isin(values_to_keep)].head(20)

,loyalty_number,country,province,city,postal_code,gender,education,salary,marital_status,loyalty_card,clv,enrollment_type,enrollment_year,enrollment_month,cancellation_year,cancellation_month
5,193662,Canada,Yukon,Whitehorse,Y2K 6R0,Male,Bachelor,51124.0,Married,Star,3844.57,Standard,2012,5,Not Cancelled,Not Cancelled
123,746226,Canada,British Columbia,Whistler,V6T 1Y8,Female,Bachelor,63501.0,Married,Star,4089.04,Standard,2018,1,Not Cancelled,Not Cancelled
141,279419,Canada,British Columbia,West Vancouver,V6V 8Z3,Female,College,73455.0,Single,Star,4117.37,Standard,2013,7,Not Cancelled,Not Cancelled
161,354438,Canada,Quebec,Montreal,H2T 2J6,Male,College,73455.0,Married,Star,4167.09,Standard,2018,9,Not Cancelled,Not Cancelled
537,411523,Canada,Alberta,Edmonton,T9G 1W3,Male,Bachelor,62761.0,Single,Star,4747.73,Standard,2016,10,Not Cancelled,Not Cancelled
549,615439,Canada,Manitoba,Winnipeg,R2C 0M5,Male,Doctor,109664.0,Single,Star,4763.33,Standard,2013,2,Not Cancelled,Not Cancelled
574,536021,Canada,Ontario,Toronto,M8Y 4K8,Female,Bachelor,50795.0,Divorced,Star,4784.96,Standard,2016,5,Not Cancelled,Not Cancelled
699,106001,Canada,Quebec,Montreal,H2Y 4R4,Female,High School or Below,39000.0,Single,Star,4914.04,Standard,2013,1,Not Cancelled,Not Cancelled
703,890361,Canada,British Columbia,Vancouver,V6E 3Z3,Male,College,73455.0,Single,Star,4915.39,Standard,2017,4,Not Cancelled,Not Cancelled
839,825593,Canada,British Columbia,Vancouver,V1E 4R6,Female,Bachelor,74135.0,Married,Aurora,5073.28,Standard,2012,11,Not Cancelled,Not Cancelled
975,950980,Canada,Ontario,Toronto,P1J 8T7,Male,Bachelor,82300.0,Married,Aurora,5220.69,Standard,2014,2,Not Cancelled,Not Cancelled
1021,971370,Canada,Ontario,Toronto,P2T 6G3,Male,Bachelor,63791.0,Married,Aurora,5261.04,Standard,2012,7,Not Cancelled,Not Cancelled
1063,323821,Canada,British Columbia,Vancouver,V5R 1W3,Female,High School or Below,49083.0,Married,Aurora,5297.63,Standard,2016,12,Not Cancelled,Not Cancelled
1120,309230,Canada,Quebec,Quebec City,G1B 3L5,Female,Bachelor,77866.0,Married,Aurora,5365.93,Standard,2012,10,Not Cancelled,Not Cancelled
1230,968034,Canada,Newfoundland,St. John's,A1C 6H9,Female,College,73455.0,Married,Aurora,5502.73,Standard,2015,6,Not Cancelled,Not Cancelled
1275,304600,Canada,Quebec,Montreal,H4G 3T4,Male,High School or Below,73909.0,Married,Aurora,5553.80,Standard,2015,4,Not Cancelled,Not Cancelled
1310,601131,Canada,Yukon,Whitehorse,Y2K 6R0,Female,Doctor,170041.0,Married,Aurora,5584.96,Standard,2016,2,Not Cancelled,Not Cancelled
1430,361237,Canada,British Columbia,Dawson Creek,U5I 4F1,Male,Bachelor,57584.0,Divorced,Aurora,5768.09,Standard,2016,7,Not Cancelled,Not Cancelled
1438,981508,Canada,British Columbia,Vancouver,V6E 3D9,Male,Bachelor,64677.0,Married,Aurora,5786.49,Standard,2015,4,Not Cancelled,Not Cancelled
1528,465260,Canada,British Columbia,Vancouver,V6E 3Z3,Female,Bachelor,89817.0,Married,Aurora,5977.79,Standard,2012,11,Not Cancelled,Not Cancelled